docs/nlp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-18 Thu 20:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Natural Language Processing</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Natural Language Processing</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4318c42">1. How to Represent Words</a>
<ul>
<li><a href="#orge5a1038">1.1. Window-based Co-occurence Matrix</a></li>
<li><a href="#org38d14cf">1.2. Issues with SVD-based methods</a></li>
<li><a href="#orga977dfd">1.3. Iteration-based Methods (e.g. word2vec)</a>
<ul>
<li><a href="#org2a39632">1.3.1. Language Models</a>
<ul>
<li><a href="#org0a53ef0">1.3.1.1. Continuous bag-of-words (CBOW)</a></li>
<li><a href="#org9b6a1b1">1.3.1.2. <span class="todo TODO">TODO</span> Skipgram</a></li>
</ul>
</li>
<li><a href="#org75385f6">1.3.2. Training Methods</a>
<ul>
<li><a href="#orgf697794">1.3.2.1. <span class="todo TODO">TODO</span> Negative Sampling</a></li>
<li><a href="#org4b61164">1.3.2.2. <span class="todo TODO">TODO</span> Hierachical Softmax</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org581376b">1.4. Global Vectors for Word Representation (GloVe)</a>
<ul>
<li><a href="#orgee5dbe5">1.4.1. Co-occurrence Matrix</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org612ee8d">2. Word Vector Evaluation</a>
<ul>
<li><a href="#org843212a">2.1. Intrinsic</a></li>
<li><a href="#org49c7ca3">2.2. Extrinsic</a></li>
</ul>
</li>
<li><a href="#org9ac3d90">3. Neural Networks</a>
<ul>
<li><a href="#org394e96f">3.1. A neuron</a></li>
<li><a href="#orgaec5564">3.2. A single layer of neurons</a></li>
<li><a href="#org325f20e">3.3. Feed-forward computation</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4318c42" class="outline-2">
<h2 id="org4318c42"><span class="section-number-2">1</span> How to Represent Words</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://ruder.io/word-embeddings-2017/index.html">http://ruder.io/word-embeddings-2017/index.html</a>
</p>

<p>
How do we represent words as input to any of our models? There are an
estimated <b>13 million</b> tokens for the English language, some of them
have similar meanings.
</p>

<p>
The simplest representation is <b>one-hot vector</b>: we can represent
every word as a \(\mathbb{R}^{|V|x1}\) vector with all 0s and one 1 at
the index of that word in the sorted english language.
</p>

<p>
To reduce the size of this space, we can use SVD-based methods. For
instance, accumulating co-occurrence count into a matrix <code>X</code>, and
perform SVD on <code>X</code> to get a \(USV^T\) decomposition. We can then use the
rows of <code>U</code> as the word embeddings for all words in the dictionary.
</p>
</div>
<div id="outline-container-orge5a1038" class="outline-3">
<h3 id="orge5a1038"><span class="section-number-3">1.1</span> Window-based Co-occurence Matrix</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Count the number of times each word appears inside a window of a
particular size around the word of interest. We calculate this count
for all words in the corpus.
</p>
</div>
</div>
<div id="outline-container-org38d14cf" class="outline-3">
<h3 id="org38d14cf"><span class="section-number-3">1.2</span> Issues with SVD-based methods</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Dimensions of the matrix can change very often (new words added to corpus)</li>
<li>Matrix is extremely sparse as most words don't co-occur</li>
<li>Matrix is very high-dimensional</li>
<li>Quadratic cost to perform SVD</li>
</ol>

<p>
Some solutions include:
</p>
<ol class="org-ol">
<li>Ignore function words (blacklist)</li>
<li>Apply a ramp window (distance between words)</li>
<li>Use <a href="https://statistics.laerd.com/statistical-guides/pearson-correlation-coefficient-statistical-guide.php">Pearson correlation</a> and set negative counts to 0 instead of raw count.</li>
</ol>
</div>
</div>
<div id="outline-container-orga977dfd" class="outline-3">
<h3 id="orga977dfd"><span class="section-number-3">1.3</span> Iteration-based Methods (e.g. word2vec)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Design a model whose parameters are the word vectors, and train the
model on a certain objective. Discard the model, and use the vectors
learnt.
Efficient tree structure to compute probabiltiies for all the vocabulary
</p>
</div>
<div id="outline-container-org2a39632" class="outline-4">
<h4 id="org2a39632"><span class="section-number-4">1.3.1</span> Language Models</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
The model will need to assign a probability to a sequence of tokens.
We want a high probability for a sentence that makes sense, and a low
probability for a sentence that doesn't.
</p>

<p>
Unigrams completely ignore this, and a nonsensical sentence might
actually be assigned a high probability. Bigrams are a naive way of
evaluating a whole sentence.
</p>
</div>
<div id="outline-container-org0a53ef0" class="outline-5">
<h5 id="org0a53ef0"><span class="section-number-5">1.3.1.1</span> Continuous bag-of-words (CBOW)</h5>
<div class="outline-text-5" id="text-1-3-1-1">
<p>
Predicts a center word from the surrounding context in terms of word
vectors.
</p>

<p>
For each word, we want to learn 2 vectors:
</p>
<ol class="org-ol">
<li>v: (input vector) when the word is in the context</li>
<li>u: (output vector) when the word is in the center</li>
</ol>


<ul class="org-ul">
<li>known parameters
<dl class="org-dl">
<dt>input</dt><dd>sentence represented by one-hot vectors</dd>
<dt>output</dt><dd>one hot vector of the known center word</dd>
</dl></li>
</ul>

<p>
Create 2 matrices \(\mathbb{V} \in \mathbb{R}^{n \times |V|}\) and
\(\mathbb{U} \in \mathbb{R}^{|V| \times n}\), where n is the arbitrary
size which defines the size of the embedding space.
</p>

<p>
\(V\) is the input word matrix such that the <i>i</i>-th column of \(V\) is the
$n$-dimensional embedded vector for word \(w_i\) when it is an input to
this model. \(U\) is the output word matrix.
</p>

<ol class="org-ol">
<li>Generate one-hot word vectors for the input context of size m.</li>
<li>Get our embedded word vectors for the context: (\(v_{c-m} =
     Vx^{c-m}\), &#x2026;)</li>
<li>Average these vectors to get \(\hat{v} = \frac{\sum v}{2m} \in \mathbb{R^n}\)</li>
<li>Generate a score vector \(z = U\hat{v} \in \mathbb{R}^{|V|}\) As the
dot product of similar vectors is higher, it will push simila words
close to each other in order to achieve a high score.</li>
<li>Turn the scores into probabilities \(\hat{y} = softmax(z) \in \mathbb{R}^{|V|}\)</li>
</ol>

<p>
Minimise loss function (cross entropy), and use stochastic gradient
descent to update all relevant word vectors.
</p>
</div>
</div>
<div id="outline-container-org9b6a1b1" class="outline-5">
<h5 id="org9b6a1b1"><span class="section-number-5">1.3.1.2</span> <span class="todo TODO">TODO</span> Skipgram</h5>
<div class="outline-text-5" id="text-1-3-1-2">
<p>
<a href="http://mccormickml.com/2016/04/19/word2vec-tutorial-the-skip-gram-model/">http://mccormickml.com/2016/04/19/word2vec-tutorial-the-skip-gram-model/</a>
</p>

<p>
Predicts the distribution of context words from a center word. This is
very similar to the CBOW approach, wind the input and output vectors
reversed. Here, a naive Bayes assumption is invoked: that given the
center word, all output words are completely independent.
</p>

<p>
Input vector: one-hot vectors corresponding to the vocabulary
</p>

<p>
The neural network is consists of one hidden layer of \(n\) units, where
\(n\) is the desired dimension of the word vector. The output layer is a
softmax regression layer, outputting a value between 0 and 1. We want
the value for the context words to be high, and the non-context words
to be low.
</p>

<p>
After training, the output layer is discarded, and the weights at the
hidden layer are the word vectors we want.
</p>
</div>
</div>
</div>

<div id="outline-container-org75385f6" class="outline-4">
<h4 id="org75385f6"><span class="section-number-4">1.3.2</span> Training Methods</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
In practice, negative sampling works better for frequently occurring
words and lower-dimensional vectors, and hierachical softmax works
better for infrequent words.
</p>
</div>
<div id="outline-container-orgf697794" class="outline-5">
<h5 id="orgf697794"><span class="section-number-5">1.3.2.1</span> <span class="todo TODO">TODO</span> Negative Sampling</h5>
<div class="outline-text-5" id="text-1-3-2-1">
<p>
Take \(k\) negative samples, and minimise the probability of the two
words co-occurring while also maximising the probability of the two
words in the same window co-occur.
</p>
</div>
</div>
<div id="outline-container-org4b61164" class="outline-5">
<h5 id="org4b61164"><span class="section-number-5">1.3.2.2</span> <span class="todo TODO">TODO</span> Hierachical Softmax</h5>
<div class="outline-text-5" id="text-1-3-2-2">
<p>
Hierachical Softmax uses a binary tree to represent all words in the
vocabulary. Each leaf of the tree is a word, and there is a unique
path from root to leaf. The probability of a word \(w\) given a vector
\(w_i\), \(P(w|w_i)\), is equal to the probability of a random walk
starting from the root and ending in the leaf node corresponding to
\(w\).
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org581376b" class="outline-3">
<h3 id="org581376b"><span class="section-number-3">1.4</span> Global Vectors for Word Representation (GloVe)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Count-based methods of generating word embeddings rely on global
statistical information, and do poorly on tasks such as word analogy,
indicating a sub-optimal vector space structure.
</p>

<p>
word2vec presents a window-based method of generating word-embeddings
by making predictions in context-based windows, demonstrating the
capacity to capture complex linguistic patterns beyond word
similarity.
</p>

<p>
GloVe consists of a weighted least-squares model that combines the
benefits of the word2vec skip-gram model when it comes to word analogy
tasks, but also trains on global word-word co-occurrence counts, and
produces a word vector space with meaningful sub-structure.
</p>

<p>
The appropriate starting point for word-vector learning should be with
ratios of co-occurrence probabilities rather than the probabilities
themselves. Since vector spaces are inherently linear structures, the
most natural way to encode the information present in a ratio in the
word vector space is with vector differences.
</p>

<p>
The training objective of GloVe is to learn word vectors such that
their dot product equals the logarithm of the words’ probability of
co-occurrence. Owing to the fact that the logarithm of a ratio equals
the difference of logarithms, this objective associates (the logarithm
of) ratios of co-occurrence probabilities with vector differences in
the word vector space.
</p>
</div>

<div id="outline-container-orgee5dbe5" class="outline-4">
<h4 id="orgee5dbe5"><span class="section-number-4">1.4.1</span> Co-occurrence Matrix</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Let \(X\) denote the word-word co-occurrence matrix, where \(X_{ij}\)
indicate the number of times word \(j\) occur in the context of word
\(i\). Let \(X_i = \sum_k X_{ik}\) be the number of times any word \(k\)
appears in the context of word \(i\). Let \(P_{ij} = P(w_j|w_i) =
\frac{X_{ij}}{X_i}\) be the probability of j appearing in the context
of word \(i\).
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org612ee8d" class="outline-2">
<h2 id="org612ee8d"><span class="section-number-2">2</span> Word Vector Evaluation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org843212a" class="outline-3">
<h3 id="org843212a"><span class="section-number-3">2.1</span> Intrinsic</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Evaluation on a specific/intermediate subtask</li>
<li>Fast to compute</li>
<li>Helps understand the system</li>
<li>Not clear if really helpful unless correlation to real task is established</li>
</ul>
</div>
</div>

<div id="outline-container-org49c7ca3" class="outline-3">
<h3 id="org49c7ca3"><span class="section-number-3">2.2</span> Extrinsic</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Evaluation on a real task</li>
<li>Can take a long time to compute accuracy</li>
<li>Unclear if the subsystem is the problem or its interaction or other subsystems</li>
<li>If replacing exactly one subsystem with another improves accuracy ➡ Winning!</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9ac3d90" class="outline-2">
<h2 id="org9ac3d90"><span class="section-number-2">3</span> Neural Networks</h2>
<div class="outline-text-2" id="text-3">
<p>
Most data are not linearly separable, hence the need for non-linear
classifiers. Neural networks are a family of classifiers with
non-linear decision boundaries.
</p>
</div>

<div id="outline-container-org394e96f" class="outline-3">
<h3 id="org394e96f"><span class="section-number-3">3.1</span> A neuron</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A neuron is a generic computational unit that takes \(n\) inputs and
produces a single output. The sigmoid unit takes a $n$-dimensional
vector $x4 and produces a scalar activation (output) \(a\). This neuron
is also associated with an $n$-dimensional weight vector, \(w\), and a
bias scalar, \(b\). for example, the output of this neuron is then:
</p>

\begin{equation*}
a = \frac{1}{1 + exp(-(w^Tx + b))}
\end{equation*}

<p>
This is also frequently formulated as:
</p>

\begin{equation*}
a = \frac{1}{1 + exp(-([w^T\text{ }b] \cdot [x\text{ }1]))}
\end{equation*}
</div>
</div>

<div id="outline-container-orgaec5564" class="outline-3">
<h3 id="orgaec5564"><span class="section-number-3">3.2</span> A single layer of neurons</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This idea can be extended to multiple neurons by considering the case
where the input \(x\) is fed as input to multiple such neurons.
</p>

\begin{align*}
  \sigma\left( z \right) =
  \begin{bmatrix}
    \frac{1}{1 + exp(z_1)} \\
    \vdots \\
    \frac{1}{1 + exp(z_m)}
  \end{bmatrix}
\end{align*}

\begin{align*}
  b =
  \begin{bmatrix}
    b_1 \\
    \vdots \\
    b_m
  \end{bmatrix}
  \in \mathbb{R}^m
\end{align*}

\begin{align*}
  W =
  \begin{bmatrix}
    - && w^{(1)T} && - \\
    && \hdots && \\
    - && w^{(m)T} && -
  \end{bmatrix}
  \in \mathbb{R}^{m\times n}
\end{align*}

\begin{equation*}
z = Wx + b
\end{equation*}

<p>
The activations of the sigmoid function can be written as:
</p>

\begin{align*}
  \begin{bmatrix}
    a^{(1)} \\
    \vdots \\
    a^{(m)}
  \end{bmatrix}
  = \sigma\left( Wx + b \right)
\end{align*}

<p>
Activations indicate the presence of some weighted combination of
features. We can use these combinations to perform classification
tasks.
</p>
</div>
</div>


<div id="outline-container-org325f20e" class="outline-3">
<h3 id="org325f20e"><span class="section-number-3">3.3</span> Feed-forward computation</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Non-linear decisions cannot be classified in by feeding inputs
directly into a softmax function. Instead, we use another matrix \(U
\in \mathbb{R}^{m\times 1}\) to generate an unnormalized score for a
classification task from the activations.
</p>

\begin{equation*}
s = U^Ta = U^Tf\left( Wx + b \right)
\end{equation*}

<p>
where f is the activation function.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-01-18 Thu 20:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
